Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS00/include/pic32cm1216ls00064.h
/**
 * \brief Header file for PIC32CM1216LS00064
 *
 * Copyright (c) 2021 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2020-11-17T07:16:00Z */
#ifndef _PIC32CM1216LS00064_H_
#define _PIC32CM1216LS00064_H_

// Header version uses Semantic Versioning 2.0.0 (https://semver.org/)
#define HEADER_FORMAT_VERSION "2.0.0"

#define HEADER_FORMAT_VERSION_MAJOR (2)
#define HEADER_FORMAT_VERSION_MINOR (0)

/** \addtogroup PIC32CM1216LS00064_definitions PIC32CM1216LS00064 definitions
  This file defines all structures and symbols for PIC32CM1216LS00064:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
 *  @{
 */

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  include <stdint.h>
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !defined(SKIP_INTEGER_LITERALS)
#  if defined(_U_) || defined(_L_) || defined(_UL_)
#    error "Integer Literals macros already defined elsewhere"
#  endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with adding suffixes to integer literal constants for C/C++ */
#  define _U_(x) (x ## U)    /**< C code: Unsigned integer literal constant value */
#  define _L_(x) (x ## L)    /**< C code: Long integer literal constant value */
#  define _UL_(x) (x ## UL)  /**< C code: Unsigned Long integer literal constant value */

#else /* Assembler */

#  define _U_(x) x    /**< Assembler: Unsigned integer literal constant value */
#  define _L_(x) x    /**< Assembler: Long integer literal constant value */
#  define _UL_(x) x   /**< Assembler: Unsigned Long integer literal constant value */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* SKIP_INTEGER_LITERALS */
/** @}  end of Atmel Global Defines */

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR PIC32CM1216LS00064                                 */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** Interrupt Number Definition */
typedef enum IRQn
{
/******  CORTEX-M23 Processor Exceptions Numbers ******************************/
  Reset_IRQn                = -15, /**< -15 Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn       = -14, /**< -14 Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn            = -13, /**< -13 Hard Fault, all classes of Fault    */
  SVCall_IRQn               =  -5, /**< -5  System Service Call via SVC instruction */
  PendSV_IRQn               =  -2, /**< -2  Pendable request for system service */
  SysTick_IRQn              =  -1, /**< -1  System Tick Timer                   */
/******  PIC32CM1216LS00064 specific Interrupt Numbers ***********************************/
  OSC32KCTRL_IRQn           =   0, /**< 0   Shared between MCLK OSCCTRL OSC32KCTRL PM SUPC (OSC32KCTRL) */
  OSCCTRL_IRQn              =   0, /**< 0   Shared between MCLK OSCCTRL OSC32KCTRL PM SUPC (OSCCTRL) */
  SUPC_IRQn                 =   0, /**< 0   Shared between MCLK OSCCTRL OSC32KCTRL PM SUPC (SUPC) */
  MCLK_IRQn                 =   0, /**< 0   Shared between MCLK OSCCTRL OSC32KCTRL PM SUPC (MCLK) */
  PM_IRQn                   =   0, /**< 0   Shared between MCLK OSCCTRL OSC32KCTRL PM SUPC (PM) */
  WDT_IRQn                  =   1, /**< 1   Watchdog Timer (WDT)                */
  RTC_IRQn                  =   2, /**< 2   Real-Time Counter (RTC)             */
  EIC_EXTINT_0_IRQn         =   3, /**< 3   External Interrupt Controller (EIC) */
  EIC_EXTINT_1_IRQn         =   4, /**< 4   External Interrupt Controller (EIC) */
  EIC_EXTINT_2_IRQn         =   5, /**< 5   External Interrupt Controller (EIC) */
  EIC_EXTINT_3_IRQn         =   6, /**< 6   External Interrupt Controller (EIC) */
  EIC_EXTINT_4_IRQn         =   7, /**< 7   External Interrupt Controller (EIC) */
  EIC_EXTINT_5_IRQn         =   8, /**< 8   External Interrupt Controller (EIC) */
  EIC_EXTINT_6_IRQn         =   9, /**< 9   External Interrupt Controller (EIC) */
  EIC_EXTINT_7_IRQn         =  10, /**< 10  External Interrupt Controller (EIC) */
  EIC_OTHER_IRQn            =  11, /**< 11  External Interrupt Controller (EIC) */
  FREQM_IRQn                =  12, /**< 12  Frequency Meter (FREQM)             */
  NVMCTRL_IRQn              =  13, /**< 13  Non-Volatile Memory Controller (NVMCTRL) */
  PORT_IRQn                 =  14, /**< 14  Port Module (PORT)                  */
  DMAC_0_IRQn               =  15, /**< 15  Direct Memory Access Controller (DMAC) */
  DMAC_1_IRQn               =  16, /**< 16  Direct Memory Access Controller (DMAC) */
  DMAC_2_IRQn               =  17, /**< 17  Direct Memory Access Controller (DMAC) */
  DMAC_3_IRQn               =  18, /**< 18  Direct Memory Access Controller (DMAC) */
  DMAC_OTHER_IRQn           =  19, /**< 19  Direct Memory Access Controller (DMAC) */
  USB_IRQn                  =  20, /**< 20  Universal Serial Bus (USB)          */
  EVSYS_0_IRQn              =  21, /**< 21  Event System Interface (EVSYS)      */
  EVSYS_1_IRQn              =  22, /**< 22  Event System Interface (EVSYS)      */
  EVSYS_2_IRQn              =  23, /**< 23  Event System Interface (EVSYS)      */
  EVSYS_3_IRQn              =  24, /**< 24  Event System Interface (EVSYS)      */
  EVSYS_4_IRQn              =  25, /**< 25  Event System Interface (EVSYS)      */
  EVSYS_5_IRQn              =  26, /**< 26  Event System Interface (EVSYS)      */
  EVSYS_6_IRQn              =  27, /**< 27  Event System Interface (EVSYS)      */
  EVSYS_7_IRQn              =  28, /**< 28  Event System Interface (EVSYS)      */
  EVSYS_NSCHK_IRQn          =  29, /**< 29  Event System Interface (EVSYS)      */
  PAC_IRQn                  =  30, /**< 30  Peripheral Access Controller (PAC)  */
  SERCOM0_0_IRQn            =  31, /**< 31  Serial Communication Interface (SERCOM0) */
  SERCOM0_1_IRQn            =  32, /**< 32  Serial Communication Interface (SERCOM0) */
  SERCOM0_2_IRQn            =  33, /**< 33  Serial Communication Interface (SERCOM0) */
  SERCOM0_OTHER_IRQn        =  34, /**< 34  Serial Communication Interface (SERCOM0) */
  SERCOM1_0_IRQn            =  35, /**< 35  Serial Communication Interface (SERCOM1) */
  SERCOM1_1_IRQn            =  36, /**< 36  Serial Communication Interface (SERCOM1) */
  SERCOM1_2_IRQn            =  37, /**< 37  Serial Communication Interface (SERCOM1) */
  SERCOM1_OTHER_IRQn        =  38, /**< 38  Serial Communication Interface (SERCOM1) */
  SERCOM2_0_IRQn            =  39, /**< 39  Serial Communication Interface (SERCOM2) */
  SERCOM2_1_IRQn            =  40, /**< 40  Serial Communication Interface (SERCOM2) */
  SERCOM2_2_IRQn            =  41, /**< 41  Serial Communication Interface (SERCOM2) */
  SERCOM2_OTHER_IRQn        =  42, /**< 42  Serial Communication Interface (SERCOM2) */
  SERCOM3_0_IRQn            =  43, /**< 43  Serial Communication Interface (SERCOM3) */
  SERCOM3_1_IRQn            =  44, /**< 44  Serial Communication Interface (SERCOM3) */
  SERCOM3_2_IRQn            =  45, /**< 45  Serial Communication Interface (SERCOM3) */
  SERCOM3_OTHER_IRQn        =  46, /**< 46  Serial Communication Interface (SERCOM3) */
  SERCOM4_0_IRQn            =  47, /**< 47  Serial Communication Interface (SERCOM4) */
  SERCOM4_1_IRQn            =  48, /**< 48  Serial Communication Interface (SERCOM4) */
  SERCOM4_2_IRQn            =  49, /**< 49  Serial Communication Interface (SERCOM4) */
  SERCOM4_OTHER_IRQn        =  50, /**< 50  Serial Communication Interface (SERCOM4) */
  SERCOM5_0_IRQn            =  51, /**< 51  Serial Communication Interface (SERCOM5) */
  SERCOM5_1_IRQn            =  52, /**< 52  Serial Communication Interface (SERCOM5) */
  SERCOM5_2_IRQn            =  53, /**< 53  Serial Communication Interface (SERCOM5) */
  SERCOM5_OTHER_IRQn        =  54, /**< 54  Serial Communication Interface (SERCOM5) */
  TC0_IRQn                  =  55, /**< 55  Basic Timer Counter (TC0)           */
  TC1_IRQn                  =  56, /**< 56  Basic Timer Counter (TC1)           */
  TC2_IRQn                  =  57, /**< 57  Basic Timer Counter (TC2)           */
  TCC0_IRQn                 =  58, /**< 58  Timer Counter for Control Applications (TCC0) */
  TCC1_IRQn                 =  59, /**< 59  Timer Counter for Control Applications (TCC1) */
  TCC2_IRQn                 =  60, /**< 60  Timer Counter for Control Applications (TCC2) */
  TCC3_IRQn                 =  61, /**< 61  Timer Counter for Control Applications (TCC3) */
  ADC_OTHER_IRQn            =  62, /**< 62  Analog Digital Converter (ADC)      */
  ADC_RESRDY_IRQn           =  63, /**< 63  Analog Digital Converter (ADC)      */
  AC_IRQn                   =  64, /**< 64  Analog Comparators (AC)             */
  DAC_UNDERRUN_IRQn         =  65, /**< 65  Digital-to-Analog Converter (DAC)   */
  DAC_EMPTY_IRQn            =  66, /**< 66  Digital-to-Analog Converter (DAC)   */
  PTC_IRQn                  =  67, /**< 67  Peripheral Touch Controller (PTC)   */
  TRNG_IRQn                 =  68, /**< 68  True Random Generator (TRNG)        */
  I2S_IRQn                  =  69, /**< 69  Inter-IC Sound Interface (I2S)      */
  TRAM_IRQn                 =  70, /**< 70  TrustRAM (TRAM)                     */

  PERIPH_MAX_IRQn           =  70  /**< Max peripheral ID */
} IRQn_Type;
